import { ApplicantCardInfo } from '../../components/ApplicantCard'

export const cardsInfo: ApplicantCardInfo[] = [
  {
    id: 1,
    name: 'валера',
    surname: 'петров',
    date: 1672520400000,
    city: 'Гомель',
    description:
      'Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, ',
  },
  {
    id: 2,
    name: 'валера',
    surname: 'петров',
    date: 1693915600000,
    city: 'Гомель',
    description:
      'Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, ',
  },
  {
    id: 3,
    name: 'валера',
    surname: 'петров',
    date: 1677618000000,
    city: 'Гомель',
    description:
      'Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, ',
  },
  {
    id: 4,
    name: 'валера',
    surname: 'петров',
    date: 1680296400000,
    city: 'Гомель',
    description:
      'Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, ',
  },
  {
    id: 5,
    name: 'валера',
    surname: 'петров',
    date: 1682888400000,
    city: 'Гомель',
    description:
      'Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, ',
  },
  {
    id: 6,
    name: 'валера',
    surname: 'петров',
    date: 1685566800000,
    city: 'Гомель',
    description:
      'Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. Напишите о своих качествах, ',
  },
]
