/* eslint-disable no-useless-escape */
export const FIELDS_REG = {
  email:
    /^([a-zA-Zа-яёА-ЯЁ0-9_-]+\.)*[a-zA-Zа-яёА-ЯЁ0-9_-]+@[a-zA-Zа-яёА-ЯЁ0-9_-]+(\.[a-zA-Zа-яёА-ЯЁ0-9_-]+)*\.[a-zя-яё]{2,6}$/,
  password: /[0-9,"."]$/,
  text: /^[0-9,a-z,A-Z,а-яё,А-ЯЁ,\s,\[,\],\(,\),\{,\},!,@,#,$,%,^,&,*,.,_,=,+,-,:,;]$/,
  phone: /^\s*\+?375((33\d{3}\d{2}\d{2})|(29\d{3}\d{2}\d{2})|(44\d{3}\d{2}\d{2})|(25\d{3}\d{2}\d{2}))\s*$/,
  description: /^[0-9,a-z,A-Z,а-яё,А-ЯЁ,\s,\[,\],\(,\),\{,\},!,@,#,$,%,^,&,*,.,_,=,+,-,:,;]{15,1500}$/,
  jobTitle: /^[0-9,a-z,A-Z,а-яё,А-ЯЁ,\s,\[,\],\(,\),\{,\},!,@,#,$,%,^,&,*,.,_,=,+,-]{1,256}$/,
  contactPerson: /^[0-9,a-z,A-Z,а-яё,А-ЯЁ,\s,\[,\],\(,\),\{,\},!,@,#,$,%,^,&,*,.,_,=,+,-,:,;]{1,100}$/,
  salary: /[0-9,"."]$/,
}

export const FIELDS_HELPER_TEXT = {
  required: 'Поле обязательно для заполнения',
  matches: 'Некорректный ввод данных',
  vacancyDescription:
    'Описание должно содержать не менее 150 символов. Не допускается указывать контактные данные организации (адрес, имя, телефоны лица, разместившего вакансию)',
}
