import { City } from './Vacancies.types'

const dataCities: City[] = [
  {
    id: 1,
    region: 'Брестская область',
    cities: [
      'Барановичи',
      'Иваново',
      'Пинск',
      'Ивацевичи',
      'Берёза',
      'Каменец',
      'Пружаны',
      'Жабинка',
      'Брест',
      'Кобрин',
      'Лунинец',
      'Ганцевичи',
      'Дрогичин',
      'Малорита',
      'Микашевичи',
      'Высокое',
    ],
  },
  {
    id: 2,
    region: 'Гомельская область',
    cities: [
      'Буда-Кошелёво',
      'Василевичи',
      'Ветка',
      'Гомель',
      'Добруш',
      'Ельск',
      'Житковичи',
      'Жлобин',
      'Калинковичи',
      'Мозырь',
      'Наровля',
      'Петриков',
      'Речица',
      'Рогачёв',
      'Светлогорск',
      'Туров',
      'Хойники',
      'Чечерск',
    ],
  },
]

export default dataCities
