import { WorkerBlankFormValues } from './WorkerBlank.types'

export const userBlankData: WorkerBlankFormValues = {
  name: 'Валера',
  surname: 'Петров',
  birthday: '2023-01-01',
  location: 'Минск',
  email: 'penrov@gmail.com',
  phone: '+375333439574',
  photo: null,
  about: `Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. 
	        Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю. 
			Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю.
			Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю.
			Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю.
			Напишите о своих качествах, знаниях, увлечениях, которые, как вам кажется, будут полезны работодателю.`,
}
export const userBlankInitData: WorkerBlankFormValues = {
  name: 'Валера',
  surname: 'Петров',
  birthday: '',
  location: '',
  about: ``,
  email: 'penrov@gmail.com',
  phone: '',
  photo: null,
}
